<?php 
include_once('db.php');

if(isset($_GET['SEND_ANSWER'])){
	echo json_encode( array('result' => 'true', ) );
	exit();
}

if(isset($_GET['GET_QUESTION'])){

	$id = $_POST['questionId'];
	$no = $_POST['questionNo'];

	echo json_encode(
		array(
			'question' => ' พ่อต้องการแบ่งเงินให้ลูกแต่ละคนเท่า ๆ กัน เขาจึงได้ตั้งกฏดังต่อไปนี้ ลูกคนแรกจะได้เงิน 100 บาท <br>
			รวมกับ 1/10 ของเงินที่เหลืออยู่ ลูกคนที่สองจะได้เงิน 200 บาทรวมกับ 1/10 ของเงินที่เหลืออยู่<br>
			หลังจากแบ่งให้ลูกคนที่ 1 ไปแล้ว ลูกคนที่สามจะได้เงิน 300 บาทรวมกับ 1/10 ของเงินที่เหลืออยู่<br>
			หลังจากแบ่งให้ลูกคนที่ 1 และ 2 ไปแล้ว และแบ่งเช่นนี้เรื่อยๆ ไป ถ้าพบว่าถ้าแบ่งในลักษณะนี้แล้ว<br>
			ลูกแต่ละคนจะได้เงินเท่ากันพอดี พ่อคนนี้มีลูกกี่คน<br>',
			'choices' => array(
				'choice1' => '7 คน',
				'choice2' => '8 คน', 
				'choice3' => '9 คน', 
				'choice4' => '10 คน'
			),
			'n' => '1',
			'nTotal' => '40'
		));
	exit();
}
?>